alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
//===-- TMS320C64XLowering.cpp - TMS320C64X DAG Lowering Implementation  --===//
//
// Copyright 2010 Jeremy Morse <jeremy.morse@gmail.com>. All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
// THIS SOFTWARE IS PROVIDED BY JEREMY MORSE ``AS IS'' AND ANY EXPRESS OR
// IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
// OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
// IN NO EVENT SHALL JEREMY MORSE OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
// INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
// (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
// LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
// ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
// THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//===----------------------------------------------------------------------===//

#include "TMS320C64XLowering.h"
#include "TMS320C64XTargetMachine.h"
#include "TMS320C64XTargetObjectFile.h"

#include "llvm/DerivedTypes.h"
#include "llvm/Function.h"
#include "llvm/Intrinsics.h"
#include "llvm/CallingConv.h"
#include "llvm/GlobalVariable.h"
#include "llvm/GlobalAlias.h"
#include "llvm/CodeGen/CallingConvLower.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/MachineFunction.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineModuleInfo.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/PseudoSourceValue.h"
#include "llvm/CodeGen/SelectionDAG.h"
#include "llvm/CodeGen/SelectionDAGISel.h"
#include "llvm/CallingConv.h"
#include "llvm/CodeGen/SelectionDAGNodes.h"
#include "llvm/CodeGen/ValueTypes.h"
#include "llvm/ADT/VectorExtras.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/MC/MCSymbol.h"

using namespace llvm;

static bool CC_TMS320C64X_Custom(unsigned &ValNo,
                                 MVT &ValVT,
                                 MVT &LocVT,
                                 CCValAssign::LocInfo &LocInfo,
                                 ISD::ArgFlagsTy &ArgFlags,
                                 CCState &State)
{
  // list of all argument registers in pairs
  static const unsigned AllRegs[] = {
     TMS320C64X::A4, TMS320C64X::A5,
     TMS320C64X::B4, TMS320C64X::B5,
     TMS320C64X::A6, TMS320C64X::A7,
     TMS320C64X::B6, TMS320C64X::B7,
     TMS320C64X::A8, TMS320C64X::A9,
     TMS320C64X::B8, TMS320C64X::B9,
     TMS320C64X::A10, TMS320C64X::A11,
     TMS320C64X::B10, TMS320C64X::B11,
     TMS320C64X::A12, TMS320C64X::A13,
     TMS320C64X::B12, TMS320C64X::B13
  };

  // for i32/f32 values the 2nd reg in the pair is shadowed
  // note: odd regs shadow themselves, thus no effect
  static const unsigned ShadowRegs[] = {
    TMS320C64X::A5, TMS320C64X::A5,
    TMS320C64X::B5, TMS320C64X::B5,
    TMS320C64X::A7, TMS320C64X::A7,
    TMS320C64X::B7, TMS320C64X::B7,
    TMS320C64X::A9, TMS320C64X::A9,
    TMS320C64X::B9, TMS320C64X::B9,
    TMS320C64X::A11, TMS320C64X::A11,
    TMS320C64X::B11, TMS320C64X::B11,
    TMS320C64X::A13, TMS320C64X::A13,
    TMS320C64X::B13, TMS320C64X::B13
  };

  // just the odd ones to identify the 2nd reg of a pair
  static const unsigned LoRegs[] = {
    TMS320C64X::A5, TMS320C64X::B5,
    TMS320C64X::A7, TMS320C64X::B7,
    TMS320C64X::A9, TMS320C64X::B9,
    TMS320C64X::A11, TMS320C64X::B11,
    TMS320C64X::A13, TMS320C64X::B13
  };

  unsigned Reg = 0;
  if (ArgFlags.isSplit())
    // first reg of a split i64/f64 - allocate but don't shadow
    Reg = State.AllocateReg(AllRegs, array_lengthof(AllRegs));
  else
    // normal argument or 2nd part of split - allocate with shadow reg
    Reg = State.AllocateReg(
      AllRegs, ShadowRegs, array_lengthof(AllRegs));

  if (!Reg)
    return false;
  else if (ArgFlags.isSplit()
      || std::count(&LoRegs[0], &LoRegs[array_lengthof(LoRegs)], Reg))
    // part of a split value - make this a custom reg
    State.addLoc(
      CCValAssign::getCustomReg(ValNo, ValVT, Reg, LocVT, LocInfo));
  else
    State.addLoc(
      CCValAssign::getReg(ValNo, ValVT, Reg, LocVT, LocInfo));

  return true;
}

#include "TMS320C64XGenCallingConv.inc"

//-----------------------------------------------------------------------------

TMS320C64XLowering::TMS320C64XLowering(TargetMachine &tm)
: TargetLowering(tm, new TMS320C64XTargetObjectFile())
{
  addRegisterClass(MVT::i32, TMS320C64X::GPRegsRegisterClass);
  addRegisterClass(MVT::i32, TMS320C64X::ARegsRegisterClass);
  addRegisterClass(MVT::i32, TMS320C64X::BRegsRegisterClass);
  addRegisterClass(MVT::i32, TMS320C64X::PredRegsRegisterClass);

  setLoadExtAction(ISD::SEXTLOAD, MVT::i1, Promote);
  setLoadExtAction(ISD::EXTLOAD, MVT::i1, Custom);
  setLoadExtAction(ISD::EXTLOAD, MVT::i8, Custom);
  setLoadExtAction(ISD::EXTLOAD, MVT::i16, Custom);
  setLoadExtAction(ISD::EXTLOAD, MVT::i32, Custom);

  // All other loads have sx and zx support

  // No 32 bit load insn
  setOperationAction(ISD::GlobalAddress, MVT::i32, Custom);
  setOperationAction(ISD::JumpTable, MVT::i32, Custom);

  // No in-reg sx
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i16, Expand);
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i8, Expand);
  setOperationAction(ISD::SIGN_EXTEND_INREG, MVT::i1, Expand);

  // No divide anything
  setOperationAction(ISD::UDIV, MVT::i32, Expand);
  setOperationAction(ISD::SDIV, MVT::i32, Expand);
  setOperationAction(ISD::UREM, MVT::i32, Expand);
  setOperationAction(ISD::SREM, MVT::i32, Expand);
  setOperationAction(ISD::UDIVREM, MVT::i32, Expand);
  setOperationAction(ISD::SDIVREM, MVT::i32, Expand);

  // On dspbridge, divides and remainders are implemented by these two
  // routines. Possibly in the future we should check the target triple
  // to see whether we're targeting something with a real libc, and make
  // a choice about what divide/modulus libcalls to make. Until then,
  // assume we're always on dspbridge.
  setLibcallName(RTLIB::UDIV_I32, "__divu");
  setLibcallName(RTLIB::UREM_I32, "__remu");

  // Support for FP lib from TI
  //
  // Single-precision floating-point arithmetic.
  setLibcallName(RTLIB::ADD_F32, "__addf");
  setLibcallName(RTLIB::SUB_F32, "__subf");
  setLibcallName(RTLIB::MUL_F32, "__mpyf");
  setLibcallName(RTLIB::DIV_F32, "__divf");

  // Double-precision floating-point arithmetic.
  setLibcallName(RTLIB::ADD_F64, "__addd");
  setLibcallName(RTLIB::SUB_F64, "__subd");
  setLibcallName(RTLIB::MUL_F64, "__mpyd");
  setLibcallName(RTLIB::DIV_F64, "__divd");

  // Single-precision comparisons.
  setLibcallName(RTLIB::OEQ_F32, "__cmpf");
  setLibcallName(RTLIB::UNE_F32, "__cmpf");
  setLibcallName(RTLIB::OLT_F32, "__cmpf");
  setLibcallName(RTLIB::OLE_F32, "__cmpf");
  setLibcallName(RTLIB::OGE_F32, "__cmpf");
  setLibcallName(RTLIB::OGT_F32, "__cmpf");
  setLibcallName(RTLIB::UO_F32,  "__not_implemented");
  setLibcallName(RTLIB::O_F32,   "__not_implemented");

  setCmpLibcallCC(RTLIB::OEQ_F32, ISD::SETEQ);
  setCmpLibcallCC(RTLIB::UNE_F32, ISD::SETNE);
  setCmpLibcallCC(RTLIB::OLT_F32, ISD::SETLT);
  setCmpLibcallCC(RTLIB::OLE_F32, ISD::SETLE);
  setCmpLibcallCC(RTLIB::OGE_F32, ISD::SETGE);
  setCmpLibcallCC(RTLIB::OGT_F32, ISD::SETGT);

  // Double-precision comparisons.
  setLibcallName(RTLIB::OEQ_F64, "__cmpd");
  setLibcallName(RTLIB::UNE_F64, "__cmpd");
  setLibcallName(RTLIB::OLT_F64, "__cmpd");
  setLibcallName(RTLIB::OLE_F64, "__cmpd");
  setLibcallName(RTLIB::OGE_F64, "__cmpd");
  setLibcallName(RTLIB::OGT_F64, "__cmpd");
  setLibcallName(RTLIB::UO_F64,  "_not_implemented");
  setLibcallName(RTLIB::O_F64,   "_not_implemented");

  setCmpLibcallCC(RTLIB::OEQ_F64, ISD::SETEQ);
  setCmpLibcallCC(RTLIB::UNE_F64, ISD::SETNE);
  setCmpLibcallCC(RTLIB::OLT_F64, ISD::SETLT);
  setCmpLibcallCC(RTLIB::OLE_F64, ISD::SETLE);
  setCmpLibcallCC(RTLIB::OGE_F64, ISD::SETGE);
  setCmpLibcallCC(RTLIB::OGT_F64, ISD::SETGT);

