alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
  // Conversions between floating types.
  setLibcallName(RTLIB::FPROUND_F64_F32, "__cvtdf");
  setLibcallName(RTLIB::FPEXT_F32_F64,   "__cvtfd");

  // Floating-point to integer conversions.
  setLibcallName(RTLIB::FPTOSINT_F64_I32, "__fixdi");
  setLibcallName(RTLIB::FPTOUINT_F64_I32, "__fixdu");
  setLibcallName(RTLIB::FPTOSINT_F32_I32, "__fixfi");
  setLibcallName(RTLIB::FPTOUINT_F32_I32, "__fixfu");

  // Integer to floating-point conversions.
  setLibcallName(RTLIB::SINTTOFP_I32_F64, "__fltid");
  setLibcallName(RTLIB::SINTTOFP_I32_F32, "__fltif");
  setLibcallName(RTLIB::UINTTOFP_I32_F64, "__fltud");
  setLibcallName(RTLIB::UINTTOFP_I32_F32, "__fltuf");

  // We can generate two conditional instructions for select, not so
  // easy for select_cc
  setOperationAction(ISD::SELECT, MVT::i32, Custom);
  setOperationAction(ISD::SELECT_CC, MVT::i32, Expand);

  // Manually beat condition code setting into cmps
  setOperationAction(ISD::SETCC, MVT::i32, Custom);

  // We can emulate br_cc, maybe not brcond, do what works
  setOperationAction(ISD::BRCOND, MVT::Other, Expand);
  setOperationAction(ISD::BRCOND, MVT::i32, Expand);
  setOperationAction(ISD::BR_CC, MVT::i32, Custom);
  setOperationAction(ISD::BR_JT, MVT::Other, Expand);

  // Probably is a membarrier, but I'm not aware of it right now
  setOperationAction(ISD::MEMBARRIER, MVT::Other, Expand);

  // Should also inject other invalid operations here
  // The following might be supported, but I can't be bothered or don't
  // have enough time to work on
  setOperationAction(ISD::MULHS, MVT::i32, Expand);
  setOperationAction(ISD::MULHU, MVT::i32, Expand);
  setOperationAction(ISD::SMUL_LOHI, MVT::i32, Expand);
  setOperationAction(ISD::UMUL_LOHI, MVT::i32, Expand);
  setOperationAction(ISD::SHL_PARTS, MVT::i32, Expand);
  setOperationAction(ISD::SRA_PARTS, MVT::i32, Expand);
  setOperationAction(ISD::SRL_PARTS, MVT::i32, Expand);
  setOperationAction(ISD::ROTR, MVT::i32, Expand);

  // There's no carry support, we're supposed to use 40 bit integers
  // instead. Let llvm generate workarounds instead.
  setOperationAction(ISD::ADDC, MVT::i32, Expand);
  setOperationAction(ISD::SUBC, MVT::i32, Expand);
  setOperationAction(ISD::ADDE, MVT::i32, Expand);
  setOperationAction(ISD::SUBE, MVT::i32, Expand);

  // VACOPY and VAEND apparently have sane defaults, however
  // VASTART and VAARG can't be expanded
  setOperationAction(ISD::VASTART, MVT::Other, Custom);
  setOperationAction(ISD::VAARG, MVT::Other, Custom);
  setOperationAction(ISD::VACOPY, MVT::Other, Expand);
  setOperationAction(ISD::VAEND, MVT::Other, Expand);

  // We want to custom lower some of our intrinsics.
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::i1, Custom);
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::i16, Custom);
  setOperationAction(ISD::INTRINSIC_WO_CHAIN, MVT::i32, Custom);

  setOperationAction(ISD::INTRINSIC_VOID, MVT::i1, Custom);

  setStackPointerRegisterToSaveRestore(TMS320C64X::A15);
  computeRegisterProperties();
  return;
}

//-----------------------------------------------------------------------------

TMS320C64XLowering::~TMS320C64XLowering() {}

//-----------------------------------------------------------------------------

const char *TMS320C64XLowering::getTargetNodeName(unsigned op) const {
  switch (op) {
    default: return NULL;
    case TMSISD::BRCOND:
      return "TMSISD::BRCOND";

    case TMSISD::CALL:
      return "TMSISD::CALL";

    case TMSISD::CMPEQ:
      return "TMSISD::CMPEQ";

    case TMSISD::CMPNE:
      return "TMSISD::CMPNE";

    case TMSISD::CMPGT:
      return "TMSISD::CMPGT";

    case TMSISD::CMPGTU:
      return "TMSISD::CMPGTU";

    case TMSISD::CMPLT:
      return "TMSISD::CMPLT";

    case TMSISD::CMPLTU:
      return "TMSISD::CMPLTU";

    case TMSISD::RETURN_FLAG:
      return "TMSISD::RETURN_FLAG";

    case TMSISD::RETURN_LABEL:
      return "TMSISD::RETURN_LABEL";

    case TMSISD::RETURN_LABEL_OPERAND:
      return "TMSISD::RETURN_LABEL_OPERAND";

    case TMSISD::SELECT:
      return "TMSISD::SELECT";

    case TMSISD::WRAPPER:
      return "TMSISD::WRAPPER";

    case TMSISD::PRED_STORE:
      return "TMSISD::PRED_STORE";
  }
}

//-----------------------------------------------------------------------------

unsigned TMS320C64XLowering::getFunctionAlignment(Function const*) const {
  return 5; // 32 bytes; instruction packet
}

//-----------------------------------------------------------------------------

using namespace TMS320C64X;

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerFormalArguments(SDValue Chain,
                                         CallingConv::ID CallConv,
                                         bool isVarArg,
				         const SmallVectorImpl<ISD::InputArg> &Ins,
                                         DebugLoc dl,
                                         SelectionDAG &DAG,
                                         SmallVectorImpl<SDValue> &InVals) const
{
  SmallVector<CCValAssign, 16> ArgLocs;
  unsigned int reg;

  MachineFunction &MF = DAG.getMachineFunction();
  MachineFrameInfo *MFI = MF.getFrameInfo();
  MachineRegisterInfo &RegInfo = MF.getRegInfo();

  unsigned arg_idx = 0;
  unsigned stack_offset = 4; // Arguments start 4 bytes before the FP

  CCState CCInfo(
    CallConv, isVarArg, getTargetMachine(), ArgLocs, *DAG.getContext());

  CCInfo.AnalyzeFormalArguments(Ins, CC_TMS320C64X);

  // TI calling convention dictates that the argument preceeding the
  // variable list of arguments must also be placed on the stack.
  // This doesn't cause a problem as C dictates there must always be one
  // non-var argument. But in any case, we need to break out of the
  // register-munging loop and ensure the last fixed argument goes to
  // the stack.
  unsigned last_fixed_arg = ArgLocs.size() - 1;

  // Ditch location allocation of arguments and do our own thing - only
  // way to make varargs work correctly
  for (unsigned i = 0; i < ArgLocs.size(); ++i) {

    CCValAssign &VA = ArgLocs[i];
    EVT ObjectVT = VA.getValVT();

    switch (ObjectVT.getSimpleVT().SimpleTy) {
      default: llvm_unreachable("Unhandled argument type");
      case MVT::i1:
      case MVT::i8:
      case MVT::i16:
      case MVT::i32:
        if (!Ins[i].Used && (!isVarArg || i != last_fixed_arg)) {
          if (arg_idx < 10) arg_idx++;

          InVals.push_back(DAG.getUNDEF(ObjectVT));
        }
        else if (arg_idx < 10 && (!isVarArg || i != last_fixed_arg)) {
          // args in registers have correct locations
          // from CC_TMS320C64X_Custom
          unsigned arg_reg = VA.getLocReg();
          reg = RegInfo.createVirtualRegister(&GPRegsRegClass);
          MF.getRegInfo().addLiveIn(arg_reg, reg);
          SDValue Arg = DAG.getCopyFromReg(Chain, dl, reg, MVT::i32);

          if (ObjectVT != MVT::i32) {
            Arg = DAG.getNode(
              ISD::AssertSext, dl, MVT::i32, Arg, DAG.getValueType(ObjectVT));

            Arg = DAG.getNode(ISD::TRUNCATE, dl, ObjectVT, Arg);
          }

          InVals.push_back(Arg);
          arg_idx++;
        }
        else {
          // XXX - i64?
          int frame_idx = MFI->CreateFixedObject(4, stack_offset, true);

          SDValue FIPtr = DAG.getFrameIndex(frame_idx, MVT::i32);
          SDValue load;

          MachinePointerInfo MPI;

          if (ObjectVT == MVT::i32) {
            // XXX - Non temporal? Eh?
            load = DAG.getLoad(
              MVT::i32, dl, Chain, FIPtr, MPI, false, false, 4);
          }
          else {
            // XXX - work out alignment
            load = DAG.getExtLoad(ISD::SEXTLOAD, dl, MVT::i32,
              Chain, FIPtr, MPI, ObjectVT, false, false, 4);

            load = DAG.getNode(ISD::TRUNCATE, dl, ObjectVT, load);
          }

          InVals.push_back(load);
          stack_offset += 4;
        }
    } // switch
  } // argloop

