alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
  return Chain;
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerReturn(SDValue Chain,
                                CallingConv::ID CallConv,
				bool isVarArg,
                                const SmallVectorImpl<ISD::OutputArg> &Outs,
                                const SmallVectorImpl<SDValue> &OutVals,
                                DebugLoc dl,
                                SelectionDAG &DAG) const
{
  SmallVector<CCValAssign, 16> RLocs;
  SDValue Flag;

  CCState CCInfo(
    CallConv, isVarArg, DAG.getTarget(), RLocs, *DAG.getContext());

  CCInfo.AnalyzeReturn(Outs, RetCC_TMS320C64X);

  // Apparently we need to add this to the out list only if it's first
  if (DAG.getMachineFunction().getRegInfo().liveout_empty()) {
    for (unsigned i = 0; i != RLocs.size(); ++i)
      if (RLocs[i].isRegLoc())
        DAG.getMachineFunction().getRegInfo().addLiveOut
	  (RLocs[i].getLocReg());
  }

  for (unsigned i = 0; i != RLocs.size(); ++i) {
    CCValAssign &VA = RLocs[i];
    assert(VA.isRegLoc() && "Invalid return position");

    Chain = DAG.getCopyToReg(Chain, dl, VA.getLocReg(), OutVals[i], Flag);
    Flag = Chain.getValue(1);
  }

  if (Flag.getNode())
    return DAG.getNode(TMSISD::RETURN_FLAG, dl, MVT::Other, Chain, Flag);
  else return DAG.getNode(TMSISD::RETURN_FLAG, dl, MVT::Other, Chain);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerCall(SDValue Chain,
                                      SDValue Callee,
                                      CallingConv::ID CallConv,
                                      bool isVarArg,
                                      bool &isTailCall,
                                      const SmallVectorImpl<ISD::OutputArg> &Outs,
                                      const SmallVectorImpl<SDValue> &OutVals,
                                      const SmallVectorImpl<ISD::InputArg> &Ins,
                                      DebugLoc dl,
                                      SelectionDAG &DAG,
                                      SmallVectorImpl<SDValue> &InVals) const
{
  SmallVector<CCValAssign, 16> ArgLocs;
  unsigned arg_idx, fixed_args;

  arg_idx = 0;
  fixed_args = 0;

  isTailCall = false;

  CCState CCInfo(
    CallConv, isVarArg, getTargetMachine(), ArgLocs, *DAG.getContext());

  CCInfo.AnalyzeCallOperands(Outs, CC_TMS320C64X);

  for (unsigned i = 0; i < Outs.size(); i++) {
    if (Outs[i].IsFixed) fixed_args++;
  }

  int stacksize, bytes = 0;

  // Make our own stack and register decisions; however keep CCInfos
  // thoughts on sign extension, as they're handy.
  // Start out by guessing how much stack space we need
  if (!isVarArg) {
    if (ArgLocs.size() > 10) {
      stacksize = (ArgLocs.size() - 10) * 4; // XXX - i64?
    }
    else stacksize = 0;
  }
  else stacksize = (ArgLocs.size() - fixed_args + 1) * 4;

  // Round the amount of stack we allocate to hold stack-arguments up to
  // an 8 byte alignment - it turns out the stack on the DSP side needs
  // to remain dword aligned.
  stacksize = (stacksize + 7) & ~7;

  Chain = DAG.getCALLSEQ_START(Chain, DAG.getConstant(stacksize, MVT::i32));

  SmallVector<std::pair<unsigned int, SDValue>, 16> reg_args;
  SmallVector<SDValue, 16> stack_args;

  for (unsigned i = 0; i < ArgLocs.size(); ++i) {

    CCValAssign &va = ArgLocs[i];
    SDValue arg = OutVals[i];

    switch (va.getLocInfo()) {
      default: llvm_unreachable("Unknown arg loc");
      case CCValAssign::Full:
        break;
      case CCValAssign::SExt:
        arg = DAG.getNode(ISD::SIGN_EXTEND, dl, va.getLocVT(), arg);
        break;
      case CCValAssign::ZExt:
        arg = DAG.getNode(ISD::ZERO_EXTEND, dl, va.getLocVT(), arg);
        break;
      case CCValAssign::AExt:
        arg = DAG.getNode(ISD::ANY_EXTEND, dl,  va.getLocVT(), arg);
        break;
    }

    if (arg_idx < 10 && (!isVarArg || i < fixed_args - 1)) {
      // Additional check to ensure last fixed param and all
      // variable params go on stack, if we're vararging.

      // args in registers have correct locations from CC_TMS320C64X_Custom
      unsigned reg = va.getLocReg();
      reg_args.push_back(std::make_pair(reg, arg));
      arg_idx++;
    }
    else {
      bytes += 4; /* Offset from SP at call */

      SDValue stack_ptr = DAG.getCopyFromReg(
        Chain, dl, TMS320C64X::B15, getPointerTy());

      SDValue addr = DAG.getNode(
        ISD::ADD, dl, getPointerTy(), stack_ptr, DAG.getIntPtrConstant(bytes));

      SDValue store = DAG.getStore(
        Chain, dl, arg, addr, MachinePointerInfo(), false, false, 4);

      stack_args.push_back(store);
    }
  }

  // We now have two sets of register / stack locations to load stuff
  // into; apparently we can put the memory location ones into one big
  // chain, because they can happen independently

  SDValue InFlag;

  if (!stack_args.empty()) {
    Chain = DAG.getNode(ISD::TokenFactor, dl, MVT::Other,
                        &stack_args[0], stack_args.size());
  }

  // This chains loading to specified registers sequentially
  for (unsigned i = 0; i < reg_args.size(); ++i) {
    Chain = DAG.getCopyToReg(Chain, dl, reg_args[i].first,
                             reg_args[i].second, InFlag);
    InFlag = Chain.getValue(1);
  }

  // Following what MSP430 does, convert GlobalAddress nodes to
  // TargetGlobalAddresses.
  if (GlobalAddressSDNode *g = dyn_cast<GlobalAddressSDNode>(Callee)) {
    Callee = DAG.getTargetGlobalAddress(
      g->getGlobal(), dl, MVT::i32, g->getOffset());
  }
  else if (ExternalSymbolSDNode *e = dyn_cast<ExternalSymbolSDNode>(Callee)) {
    Callee = DAG.getTargetExternalSymbol(e->getSymbol(), MVT::i32);
  }

  // Tie this all into a "call", return a chain and a glue
  SDVTList OperandTys = DAG.getVTList(MVT::Other, MVT::Glue);
  SmallVector<SDValue, 16> ops;
  ops.push_back(Chain);
  ops.push_back(Callee);

  for (unsigned i = 0; i < reg_args.size(); ++i) {
    ops.push_back(DAG.getRegister(reg_args[i].first,
                  reg_args[i].second.getValueType()));
  }

  if (InFlag.getNode()) ops.push_back(InFlag);

  const bool isIndirectCall = (
    Callee.getOpcode() != ISD::TargetGlobalAddress &&
    Callee.getOpcode() != ISD::GlobalAddress &&
    Callee.getOpcode() != ISD::TargetExternalSymbol &&
    Callee.getOpcode() != ISD::ExternalSymbol);

