alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
  if (isIndirectCall) {

    // Unfortunately there's no direct call instruction for this. We have to
    // emulate it. That involves sticking a label directly after the call/
    // branch, and loading its address into B3 directly beforehand. Ugh...

    MachineFunction &MF = DAG.getMachineFunction();
    MachineModuleInfo &MMI = MF.getMMI();

    // generate a unique label for the return from the call, the address of
    // the label will be put into B3 and supplied to the callee to be able
    // to return from the subroutine
    MCSymbol *indirectCallOperand = MMI.getContext().CreateTempSymbol();
    const char *retLabName = indirectCallOperand->getName().data();

    SDValue glueVal = Chain.getValue(0);
    SDVTList NodeTys = DAG.getVTList(MVT::i32, MVT::Other, MVT::Glue);

    // NKim, HACK, mark the node as an external symbol for the time being.
    // This node references the external symbol as a label operand, has a
    // glue-value and also extends and propagates the chain-value
    // AJO: note the target flag '1' is being passed to tell a symbol apart from
    // a label.
    Chain = DAG.getNode(TMSISD::RETURN_LABEL_OPERAND, dl, NodeTys, Chain,
      DAG.getTargetExternalSymbol(retLabName, getPointerTy(), 1), glueVal);

    // to be sure, that the immediate (the label address) is going to land
    // in B3 we also insert a copy-to-reg node, which has three operands,
    // Value 0 is the source value, Value 1 the chain and Value 2 the glue
    Chain = DAG.getCopyToReg(Chain.getValue(1), dl, TMS320C64X::B3,
                             Chain.getValue(0), Chain.getValue(2));

    // the previously inserted node does provide a chain and a glue
    assert(Chain.getValue(0).getNode() && Chain.getValue(1).getNode() &&
      "Bad chain values detected for the indirect call DAG node!");

    ops.push_back(Chain.getValue(1));
    Chain = DAG.getNode(TMSISD::CALL, dl, OperandTys, &ops[0], ops.size());

    // now we have to mark the node apropriately to avoid funny surprises
    // (such as machine-dce removing the label, etc.)
    NodeTys = DAG.getVTList(MVT::Other, MVT::Glue);
    Chain = DAG.getNode(TMSISD::RETURN_LABEL, dl, NodeTys, Chain,
      DAG.getTargetExternalSymbol(retLabName, getPointerTy(), 0),
      Chain.getValue(1));
  }
  else {
    // now insert a regular call node for the non-register calls
    Chain = DAG.getNode(TMSISD::CALL, dl, OperandTys, &ops[0], ops.size());
  }

  Chain = DAG.getCALLSEQ_END(Chain, DAG.getConstant(stacksize, MVT::i32),
    DAG.getTargetConstant(0, MVT::i32), Chain.getValue(1));

  return LowerCallResult(
    Chain, Chain.getValue(1), CallConv, isVarArg, Ins, dl, DAG, InVals);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerCallResult(SDValue Chain,
                                            SDValue InFlag,
                                            CallingConv::ID CallConv,
                                            bool isVarArg,
                                            const SmallVectorImpl<ISD::InputArg> &Ins,
                                            DebugLoc dl,
                                            SelectionDAG &DAG,
                                            SmallVectorImpl<SDValue> &InVals) const
{
  SmallVector<CCValAssign, 16> ret_locs;
  CCState CCInfo(
    CallConv, isVarArg, getTargetMachine(), ret_locs, *DAG.getContext());

  CCInfo.AnalyzeCallResult(Ins, RetCC_TMS320C64X);

  for (unsigned i = 0; i < ret_locs.size(); ++i) {
    Chain = DAG.getCopyFromReg(Chain, dl, ret_locs[i].getLocReg(),
                                          ret_locs[i].getValVT(),
                                          InFlag).getValue(1);

    InFlag = Chain.getValue(2);
    InVals.push_back(Chain.getValue(0));
  }

  return Chain;
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerOperation(SDValue op,  SelectionDAG &DAG) const {

  switch (op.getOpcode()) {
    case ISD::GlobalAddress:
      return LowerGlobalAddress(op, DAG);
    case ISD::JumpTable:
      return LowerJumpTable(op, DAG);
    case ISD::RETURNADDR:
      return LowerReturnAddr(op, DAG);
    case ISD::BR_CC:
      return LowerBRCC(op, DAG);
    case ISD::SETCC:
      return LowerSETCC(op, DAG);

    // We only ever get custom loads when it's an extload
    case ISD::LOAD:
      return LowerExtLoad(op, DAG);
    case ISD::SELECT:
      return LowerSelect(op, DAG);
    case ISD::VASTART:
      return LowerVASTART(op, DAG);
    case ISD::VAARG:
      return LowerVAARG(op, DAG);
    case ISD::INTRINSIC_WO_CHAIN:
      return LowerIfConv(op, DAG);
    case ISD::INTRINSIC_VOID:
      return LowerIntrinsicVoid(op, DAG);
    default:
      llvm_unreachable(op.getNode()->getOperationName().c_str());
  }

  return op;
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerGlobalAddress(SDValue op, SelectionDAG &DAG) const
{
  const GlobalValue *GV = cast<GlobalAddressSDNode>(op)->getGlobal();
  int64_t offset = cast<GlobalAddressSDNode>(op)->getOffset();

  SDValue res = DAG.getTargetGlobalAddress(
    GV, op->getDebugLoc(), getPointerTy(), offset);

  return DAG.getNode(TMSISD::WRAPPER, op.getDebugLoc(), getPointerTy(), res);
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerJumpTable(SDValue op, SelectionDAG &DAG) const {

  const JumpTableSDNode *j = cast<JumpTableSDNode>(op);

  SDValue res = DAG.getTargetJumpTable(j->getIndex(), getPointerTy(), 0);
  return DAG.getNode(TMSISD::WRAPPER, op.getDebugLoc(), getPointerTy(),	res);
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerExtLoad(SDValue op, SelectionDAG &DAG) const {

  const LoadSDNode *l = cast<LoadSDNode>(op);
  SDVTList list = l->getVTList();

  return DAG.getExtLoad(ISD::SEXTLOAD, op.getDebugLoc(), list.VTs[0],
                        l->getOperand(0), l->getOperand(1),
                        l->getPointerInfo(), l->getMemoryVT(),
			l->isVolatile(), false, l->getAlignment());
}

