alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerReturnAddr(SDValue op, SelectionDAG &DAG) const {

  if (cast<ConstantSDNode>(op.getOperand(0))->getZExtValue() != 0)
   llvm_unreachable("LowerReturnAddr -> abnormal depth");

  // Right now, we always store ret addr -> slot 0.
  // Although it could be offset by something, not certain
  SDValue retaddr = DAG.getFrameIndex(0, getPointerTy());

  return DAG.getLoad(getPointerTy(), op.getDebugLoc(), DAG.getEntryNode(),
                     retaddr, MachinePointerInfo(), false, false, 4);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerBRCC(SDValue op, SelectionDAG &DAG) const {
  int pred = 1;
  ISD::CondCode cc = cast<CondCodeSDNode>(op.getOperand(1))->get();

  // Can't do setne: instead invert predicate
  if (cc == ISD::SETNE || cc== ISD::SETUNE) {
    cc = ISD::SETEQ;
    pred = 0;
  }

  SDValue Chain = DAG.getSetCC(op.getDebugLoc(), MVT::i32,
			op.getOperand(2), op.getOperand(3), cc);

  if (Chain.getNode()->getOpcode() != ISD::Constant) {
    bool negateCC;
    tie(Chain, negateCC) = ConvertSETCC(Chain, DAG);
    if (negateCC) pred = 0;
  }

  // Generate our own brcond form, operands BB, const/reg for predicate
  Chain = DAG.getNode(TMSISD::BRCOND, op.getDebugLoc(), MVT::Other,
                      op.getOperand(0), op.getOperand(4),
		      DAG.getTargetConstant(pred, MVT::i32), Chain);
  return Chain;
}

//-----------------------------------------------------------------------------

SDValue
TMS320C64XLowering::LowerSETCC(SDValue op, SelectionDAG &DAG) const {
  SDValue Chain;
  bool NegateCC;
  tie(Chain, NegateCC) = ConvertSETCC(op, DAG);

  if (NegateCC)
    Chain = DAG.getNode(
      ISD::XOR, op.getDebugLoc(), MVT::i32, Chain, DAG.getConstant(1, MVT::i32));

  return Chain;
}

//-----------------------------------------------------------------------------

std::pair<SDValue,bool>
TMS320C64XLowering::ConvertSETCC(SDValue op, SelectionDAG &DAG) const {

  unsigned int opcode;
  bool NegateCC = false;

  SDValue lhs = op.getOperand(0);
  SDValue rhs = op.getOperand(1);

  ISD::CondCode cc = cast<CondCodeSDNode>(op.getOperand(2))->get();

  switch (cc) {
    case ISD::SETFALSE:
    case ISD::SETTRUE:
    case ISD::SETFALSE2:
    case ISD::SETTRUE2:
    case ISD::SETCC_INVALID:
    case ISD::SETOEQ:
    case ISD::SETOGT:
    case ISD::SETOGE:
    case ISD::SETOLT:
    case ISD::SETOLE:
    case ISD::SETONE:
    case ISD::SETO:
    case ISD::SETUO:
    default:
      llvm_unreachable("Unsupported condcode");

    case ISD::SETEQ:
    case ISD::SETUEQ:
      opcode = TMSISD::CMPEQ;
      break;
    case ISD::SETUGT:
      opcode = TMSISD::CMPGTU;
      break;
    case ISD::SETUGE:
      opcode = TMSISD::CMPLTU;
      NegateCC = true;
      break;
    case ISD::SETULT:
      opcode = TMSISD::CMPLTU;
      break;
    case ISD::SETULE:
      opcode = TMSISD::CMPGTU;
      NegateCC = true;
      break;
    case ISD::SETUNE:
      opcode = TMSISD::CMPNE;
      break;
    case ISD::SETGT:
      opcode = TMSISD::CMPGT;
      break;
    case ISD::SETGE:
      opcode = TMSISD::CMPLT;
      NegateCC = true;
      break;
    case ISD::SETLT:
      opcode = TMSISD::CMPLT;
      break;
    case ISD::SETLE:
      opcode = TMSISD::CMPGT;
      NegateCC = true;
      break;
    case ISD::SETNE:
      opcode = TMSISD::CMPNE;
      break;
  }

  SDValue Chain = DAG.getNode(opcode, op.getDebugLoc(), MVT::i32, lhs, rhs);
  return std::make_pair(Chain, NegateCC);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerSelect(SDValue op, SelectionDAG &DAG) const {
  SDValue ops[4];

  // Operand 1 is true/false, selects operand 2 or 3 respectively
  // We'll generate this with two conditional move instructions - moving
  // the true/false result to the same register. In theory these could
  // be scheduled in the same insn packet (given that only one will
  // execute out of the pair, due to the conditional)

  ops[0] = op.getOperand(1);
  ops[1] = op.getOperand(2);
  ops[2] = DAG.getTargetConstant(0, MVT::i32);
  ops[3] = op.getOperand(0);
  return DAG.getNode(TMSISD::SELECT, op.getDebugLoc(), MVT::i32, ops, 4);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerVASTART(SDValue op, SelectionDAG &DAG) const {

  int num_normal_params =
    DAG.getMachineFunction().getFunction()->getFunctionType()->getNumParams();

  int stackgap;

  // As referenced elsewhere, TI specify the last fixed argument has to
  // go on the stack. Also, any other overflow.
  if (num_normal_params <= 10) stackgap = 4;
  else stackgap = (num_normal_params - 10) * 4;

  // That gives us the offset of the last fixed stack argument; now
  // increment that to point at the first var argument
  stackgap += 4;

  SDValue Chain = DAG.getNode(ISD::ADD, op.getDebugLoc(), MVT::i32,
				DAG.getRegister(TMS320C64X::A15, MVT::i32),
				DAG.getConstant(stackgap, MVT::i32));
  const Value *SV = cast<SrcValueSDNode>(op.getOperand(2))->getValue();

  return DAG.getStore(op.getOperand(0), op.getDebugLoc(),
    Chain, op.getOperand(1), MachinePointerInfo(SV), false, false, 4);
}

//-----------------------------------------------------------------------------

SDValue TMS320C64XLowering::LowerVAARG(SDValue op, SelectionDAG &DAG) const {

  // Largely copy sparc
  SDNode *n = op.getNode();
  EVT vt = n->getValueType(0);
  SDValue chain = n->getOperand(0);
  SDValue valoc = n->getOperand(1);
  const Value *SV = cast<SrcValueSDNode>(n->getOperand(2))->getValue();

  // Load point to vaarg list
//    MVT::i32, op.getDebugLoc(), chain, valoc, SV, 0, false, false, 4);
  SDValue loadptr = DAG.getLoad(MVT::i32, op.getDebugLoc(),
    chain, valoc, MachinePointerInfo(SV), false, false, 4);

  // Calculate address of next vaarg
  SDValue newptr = DAG.getNode(ISD::ADD, op.getDebugLoc(), MVT::i32,
    loadptr, DAG.getConstant(vt.getSizeInBits()/8, MVT::i32));

  // Store that back to wherever we're storing the vaarg list
//    loadptr.getValue(1), op.getDebugLoc(), newptr, valoc, SV, 0, false, false, 4);
  chain = DAG.getStore(loadptr.getValue(1), op.getDebugLoc(),
    newptr, valoc, MachinePointerInfo(SV), false, false, 4);

  // Actually load the argument
  return DAG.getLoad(
    vt, op.getDebugLoc(), chain, loadptr, MachinePointerInfo(), false, false, 4);
}

