alexjordan/LLVM-TMS320C64X/lib/Target/TMS320C64X/TMS320C64XLowering.cpp
// This lowers the INTRINSIC_WO_CHAIN node used for if conversion.
// Right now the semantics are the same as SELECT's
SDValue
TMS320C64XLowering::LowerIfConv(SDValue op, SelectionDAG &DAG) const
{
	MachineFunction &MF = DAG.getMachineFunction();
	MachineRegisterInfo &RegInfo = MF.getRegInfo();
  DebugLoc dl = op.getDebugLoc();
  unsigned IntNo = cast<ConstantSDNode>(op.getOperand(0))->getZExtValue();
  assert (IntNo == Intrinsic::vliw_ifconv_t);
  //assert(DAG.getRoot()->getOpcode() == ISD::BR);


	// Operand 1 is true/false, selects operand 2 or 3 respectively
	// We'll generate this with two conditional move instructions - moving
	// the true/false result to the same register. In theory these could
	// be scheduled in the same insn packet (given that only one will
	// execute out of the pair, due to the conditional)

	SDValue ops[4];
	ops[0] = DAG.getNode(ISD::ZERO_EXTEND, dl, MVT::i32, op.getOperand(2)); // true val
	ops[1] = DAG.getNode(ISD::ZERO_EXTEND, dl, MVT::i32, op.getOperand(3)); // false val
	ops[2] = DAG.getTargetConstant(0, MVT::i32); // always 0 ?
	ops[3] = DAG.getNode(ISD::ZERO_EXTEND, dl, MVT::i32, op.getOperand(1)); // condition
  return DAG.getNode(TMSISD::SELECT, dl, MVT::i32, ops, 4);
  //unsigned reg = RegInfo.createVirtualRegister(&GPRegsRegClass);
  //SDValue Chain = DAG.getCopyToReg(DAG.getEntryNode(), dl, reg, op.getOperand(3));
  //Chain = DAG.getCopyToReg(Chain, dl, reg, op.getOperand(2));
  //return DAG.getCopyFromReg(Chain, dl, reg, MVT::i32);
}

// Lower the predicated store intrinsic to a pseudo node
SDValue
TMS320C64XLowering::LowerIntrinsicVoid(SDValue op, SelectionDAG &DAG) const
{
	MachineFunction &MF = DAG.getMachineFunction();
  DebugLoc dl = op.getDebugLoc();
  unsigned IntNo = cast<ConstantSDNode>(op.getOperand(1))->getZExtValue();
  assert (IntNo == Intrinsic::vliw_predicate_store);

  ConstantSDNode *Const = dyn_cast<ConstantSDNode>(op.getOperand(2));
  assert(Const);
  bool pred_bit = (bool)Const->getSExtValue();

	SDValue ops[3];
	ops[0] = op.getOperand(0); // chain
	ops[1] = DAG.getTargetConstant(pred_bit, MVT::i32); // predicate true/false bit
	ops[2] = DAG.getNode(ISD::ZERO_EXTEND, dl, MVT::i32, op.getOperand(3)); // condition
  return DAG.getNode(TMSISD::PRED_STORE, dl, MVT::Other, ops, 3);
}

// We want custom lower based on args and return value, this seems to do it
void TMS320C64XLowering::ReplaceNodeResults(SDNode *N,
                                             SmallVectorImpl<SDValue>&Results,
                                             SelectionDAG &DAG) {
  SDValue Res = LowerOperation(SDValue(N, 0), DAG);
  if (Res.getNode())
    Results.push_back(Res);
}
